brew "chezmoi"
brew "eza"
brew "fastfetch"
brew "fzf"
brew "lazygit"
brew "neovim"
brew "nvm"
brew "pandoc"
brew "rustup"
brew "starship"
brew "zoxide"
cask "blip"
cask "font-hack-nerd-font"
cask "font-monaspace"
cask "kitty"
cask "mos"
cask "visual-studio-code"
vscode "1yib.rust-bundle"
vscode "aaron-bond.better-comments"
vscode "alefragnani.project-manager"
vscode "arrterian.nix-env-selector"
vscode "astro-build.astro-vscode"
vscode "azemoh.one-monokai"
vscode "biomejs.biome"
vscode "christian-kohler.npm-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "digitalbrainstem.javascript-ejs-support"
vscode "donjayamanne.githistory"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "fill-labs.dependi"
vscode "formulahendry.code-runner"
vscode "franneck94.c-cpp-runner"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-pull-request-github"
vscode "kevinrose.vsc-python-indent"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "mechatroner.rainbow-csv"
vscode "mkhl.direnv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "naumovs.color-highlight"
vscode "pinage404.nix-extension-pack"
vscode "pkief.material-icon-theme"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "slint.slint"
vscode "streetsidesoftware.code-spell-checker"
vscode "sumneko.lua"
vscode "swiftlang.swift-vscode"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vue.volar"
vscode "w88975.code-translate"
vscode "wallabyjs.quokka-vscode"
vscode "xabikos.javascriptsnippets"
vscode "zhuangtongfa.material-theme"
