tap "cormacrelf/tap"
tap "jenkinpan/tap"
tap "lihaoyun6/tap"
tap "sst/tap"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Multi-shell multi-command argument completer
brew "carapace"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Console Matrix
brew "cmatrix"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Plugin manager for the Fish shell
brew "fisher"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Install and debug iPhone apps from the command-line
brew "ios-deploy"
# Handy way to save and run project-specific commands
brew "just"
# Simple terminal UI for git commands
brew "lazygit"
# Library to communicate with iOS devices natively
brew "libimobiledevice"
# Mac App Store command-line interface
brew "mas"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# CLI for Mermaid library
brew "mermaid-cli"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Modern shell for the GitHub era
brew "nushell"
# Development kit for the Java programming language
brew "openjdk@17"
# Swiss-army knife of markup format conversion
brew "pandoc"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Rust toolchain installer
brew "rustup"
# Cross-shell prompt for astronauts
brew "starship"
# Modernized, complete, self-contained TeX/LaTeX engine
brew "tectonic"
# Enables extra languages support for Tesseract
brew "tesseract-lang"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Incremental parsing library
brew "tree-sitter"
# Parser generator tool
brew "tree-sitter-cli"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# CLI tool for development to update rustup toolchain, mise maintained tools and homebrew packages
brew "jenkinpan/tap/devtool"
# Get the battery level of all your devices on your Mac.
cask "airbattery"
# Application uninstaller
cask "appcleaner"
# Send any size file between devices
cask "blip"
# Utility that prevents the system from going to sleep
cask "caffeine"
# Clean keyboard and trackpad
cask "cleanupbuddy"
# Write, edit, and chat about your code with AI
cask "cursor"
# Voice and text chat software
cask "discord"
cask "font-hack-nerd-font"
cask "font-monaspace"
cask "font-monaspace-nf"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Free and open-source media player
cask "iina"
# GPU-based terminal emulator
cask "kitty"
# Open-source cross-platform alternative to AirDrop
cask "localsend"
# Smooths scrolling and set mouse scroll directions independently
cask "mos"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
# Replacement for Docker Desktop
cask "orbstack"
# EPUB ebook editor
cask "sigil"
# Unpacks archive files
cask "the-unarchiver"
# Native desktop client for WhatsApp
cask "whatsapp"
# Multiplayer code editor
cask "zed"
mas "AdBlocker", id: 1018301773
mas "APTV", id: 1630403500
mas "Command X", id: 6448461551
mas "Developer", id: 640199958
mas "Dropover", id: 1355679052
mas "Goodnotes", id: 1444383602
mas "Hidden Bar", id: 1452453066
mas "Infuse", id: 1136220934
mas "Keynote讲演", id: 409183694
mas "Numbers表格", id: 409203825
mas "Pages文稿", id: 409201541
mas "PDFgear", id: 6469021132
mas "Quantumult X", id: 1443988620
mas "Shadowrocket", id: 932747118
mas "Xcode", id: 497799835
cargo "cargo-binstall"
cargo "cargo-bundle"
cargo "cargo-cache"
cargo "cargo-fresh"
cargo "create-tauri-app"
cargo "mdbook"
cargo "mdbook-epub"
cargo "mdbook-pandoc"
cargo "nu_plugin_file"
cargo "nu_plugin_formats"
cargo "nu_plugin_gstat"
cargo "nu_plugin_highlight"
cargo "nu_plugin_inc"
cargo "nu_plugin_polars"
cargo "topiary-cli"
